%%
x = 0:0.1:2*pi;
y1 = sin(x);
y2 = cos(x);
%%
%二维曲线绘制
    %基本函数
        %plot（y)
            %y为向量
                plot(y1);   %纵坐标为y的值横坐标自动为元素序号（角标+1），此处为1~9
            %y为矩阵
                figure; %开启新绘图窗口，下一次绘图在新窗口
                y = [y1', y2']; %先绘制曲线
                plot(y);    %当y为矩阵，按每一列画出曲线，颜色自动区分
            %plot（x, y)
                %xy为向量
                    plot(x, y1);    %先绘制曲线
            %plot（x1, y1, x2, y2...)
                plot(x, y1, x, y2); %在同一个窗口同一个坐标轴绘制多条曲线
        %线形图形格式设置
            %线形颜色数据点
                plot(x, y1, 'b:o'); %蓝色 点线 圆圈
                %b g r c青 m紫 y k黑 w
                %-实线 :点线 --虚线 -.点画线
                %.实点 o源圆圈 x叉 *星号 s方块 d钻石 v下三角 ^上三角 <左三角 >右三角 p五角星 h六角星
            %坐标轴
                plot(x, y1);
                axis([-1*pi,3*pi, -1.5, 1.5]);  %规定横纵坐标范围
        %图形修饰
            %标题标签
                tittle('a tittle'); %图像标题
                xlabel('this is x');    %x轴标记，同理还有ylabel
                
                